import pandas as pd

df = pd.read_csv('t_kjv.csv')

biblechp = {
    '창세기': '1',
    '출애굽기': '2',
    '레위기': '3',
    '민수기': '4',
    '신명기': '5',
    '여호수아': '6',
    '사사기': '7',
    '룻기': '8',
    '사무엘상': '9',
    '사무엘하': '10',
    '열왕기상': '11',
    '열왕기하': '12',
    '역대상': '13',
    '역대하': '14',
    '에스라': '15',
    '느헤미야': '16',
    '에스더': '17',
    '욥기': '18',
    '시편': '19',
    '잠언': '20',
    '전도서': '21',
    '아가': '22',
    '이사야': '23',
    '예레미야': '24',
    '예레미야애가': '25',
    '에스겔': '26',
    '다니엘': '27',
    '호세아': '28',
    '요엘': '29',
    '아모스': '30',
    '오바댜': '31',
    '요나': '32',
    '미가': '33',
    '나훔': '34',
    '하박국': '35',
    '스바냐': '36',
    '학개': '37',
    '스가랴': '38',
    '말라기': '39',
    '마태복음': '40',
    '마가복음': '41',
    '누가복음': '42',
    '요한복음': '43',
    '사도행전': '44',
    '로마서': '45',
    '고린도전서': '46',
    '고린도후서': '47',
    '갈라디아서': '48',
    '에베소서': '49',
    '빌립보서': '50',
    '골로새서': '51',
    '데살로니가전서': '52',
    '데살로니가후서': '53',
    '디모데전서': '54',
    '디모데후서': '55',
    '디도서': '56',
    '빌레몬서': '57',
    '히브리서': '58',
    '야고보서': '59',
    '베드로전서': '60',
    '베드로후서': '61',
    '요한일서': '62',
    '요한이서': '63',
    '요한삼서': '64',
    '유다서': '65',
    '요한계시록': '66',

}

v1 = input('말씀?')

v1 = biblechp[v1]

v2 = input('장?')

if len(str(v2)) == 1:
    v2 = '00'+str(v2)
elif len(str(v2)) == 2:
    v2 = '0'+str(v2)

v3 = input('절?')

if len(str(v3)) == 1:
    v3 = '00'+str(v3)
elif len(str(v3)) == 2:
    v3 = '0'+str(v3)

# value = 1001001

value = v1+v2+v3

bibleverse = df[df['id'] == int(value)]['t'].values[0]

print(bibleverse)